Catalogs/упТипыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыТС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеЗоны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосадочныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчетаВремениВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнаряженнаяМасса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГрузаКонтейнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыКузововТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКлассыОпасныхГрузов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлассОпасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатьиРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УстанавливаемоеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОборудования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыДополнительногоОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяМонтажа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДемонтажа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упВидыТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыТранспорта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Водный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воздушный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегковойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузовойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецтехника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автобус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Железнодорожный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыТС/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПараметров = Справочники.упТипыТС.ПолучитьСписокПараметровОтбора();
	ПараметрыВыбора = Новый Структура;
	Для Каждого ИмяКлюча Из СписокПараметров Цикл
		Если Параметры.Свойство(ИмяКлюча) Тогда
			ЗначениеПараметр = Параметры[ИмяКлюча];
			Если ЗначениеПараметр=Неопределено Тогда
				Продолжить;
			Иначе
				ПараметрыВыбора.Вставить(ИмяКлюча, Параметры[ИмяКлюча]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Параметры.Отбор.Свойство("ВидТранспорта") Тогда
		ПараметрыВыбора.Вставить("ВидТранспорта", Параметры.Отбор.ВидТранспорта);
	КонецЕсли;
	УстановитьПараметрыДляФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ЗаписанТипТС" Тогда
		Если ТипЗнч(Параметр)=ТИП("Структура") Тогда
			Если Параметр.Свойство("ЭтоНовый") Тогда
				Если Параметр.ЭтоНовый Тогда
					Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
					УстановитьПараметрыДляФормы();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыДляФормы()

	Если ЗначениеЗаполнено(ПараметрыВыбора.ВидПеревозки) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Справочники.упТипыТС.ПолучитьДоступныеТипыТС(ПараметрыВыбора), ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	Если Не ПараметрыВыбора.Свойство("ВидТранспорта") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидТранспорта", Перечисления.упВидыТранспорта.Контейнер, ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;

КонецПроцедуры // УстановитьПараметрыДляФормы()

#КонецОбласти
